ChalmersUniversiy/08_userDirectoryOrganizationAndCompilation/2_myIcoFoamWithNewBC/tests/2_myIcoFoamWithNewBCTest/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.5;

deltaT          0.005;

writeControl    timeStep;

writeInterval   20;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

//libs ("libmyFiniteVolume.so");
// Note that if the libs(*) line is still present in the controlDict file of the case, the solver
// throws a warning that there is a duplicate entry in the runtime table. You should never have
// duplicate entries, since it is unclear which entry is being used. Just remove the libs(*) line
// to get rid of the problem.
// ************************************************************************* //
